FROM python:3.10

# Указание конкретной оболочки, которая будет использоваться для выполнения команд в контейнере
SHELL ["/bin/bash", "-c"] 

# Запрещаем создание файлов с кэшем внутри контейнера (1), иначе Python будет создавать .pyc файлы 
# для ускорения повторной компиляции и выполнения программ (0)
ENV PYTHONDONTWRITEBYTECODE 1 

# Указываем полный вывод ошибок приложения в stdout (1), а иначе вывод Python будет буферизированным (0)
ENV PYTHONUNBUFFERED 1 

# Обновляем пакет pip внутри контейнера
RUN pip install --upgrade pip


# Обновление списка пакетов из репозиториев APT в контейнере и установка доп пакетов и зависимостей
RUN apt update && apt -qy install gcc libjpeg-dev libxslt-dev libpq-dev gettext cron openssh-client \
    flake8 locales neovim

# gcc (GNU Compiler Collection) — набор компиляторов для различных языков программирования, таких как C, C++ и др.
# libjpeg-dev: Библиотека для работы с изображениями в формате JPEG.
# libxslt-dev: Библиотека для работы с XSLT (eXtensible Stylesheet Language Transformations).
# libpq-dev: Настройка для разработки приложений, использующих PostgreSQL.
# gettext: Утилиты для работы с локализацией и интернационализацией.
# cron: Планировщик задач.
# openssh-client: Клиент OpenSSH для подключения к другим удаленным хостам по SSH.
# flake8: Инструмент для проверки стиля кода Python.
# locales: Набор файлов локализации системы.




# Создаём нового пользователя с именем "andrey" в контейнере
# -m: Создает домашнюю директорию для пользователя, если она еще не существует.
# -s /bin/bash: Устанавливает исполняемый файл для оболочки по умолчанию для нового пользователя на /bin/bash.
# chmod 777 /opt /run: Эта команда устанавливает права доступа для директорий /opt и /run
RUN useradd -rms /bin/bash andrey && chmod 777 /opt /run

# Указываем рабочую директории внутри контейнера
WORKDIR /pharm_app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости проекта
RUN pip install -r requirements.txt

# Копируем модержимое проекта в директорию выше, то есть в pharm_app
COPY --chown=andrey:andrey . .

# Выбираем нового пользователя и от его имени выполняем команду ниже
USER andrey

# Перечень команд, который выполнит командная оболочка контейнера
CMD ["python3", "manage.py", "runserver", "0.0.0.0:8000"]

